[{"ABR Holdings Ltd": {"About": "ABR Holdings Limited is a Singapore based food and beverage company listed on the secondary board of the Singapore Exchange, Sesdaq. Established in 1978, it first held the franchise for Swensen's in Singapore. It holds the franchise of casual dining restaurant, Swensen's in Asia and Oceania, which has restaurants in Singapore and Malaysia. The group also has the franchise for Yogen Früz, an international chain of frozen yogurt and smoothie stores.", "Traded as": "SGX: 533", "Industry": "Food Retail Franchisee", "Founded": "1978 (1978), Singapore", "Headquarters": "Singapore", "Website": "http://www.abr.com.sg"}}, {"2C2P": {"About": "2C2P is a Singapore-headquartered pan-Asian payment services company that works with financial institutions, e-commerce and m-commerce merchants. It operates across Southeast Asia, including in Cambodia, Indonesia, Laos, Malaysia, Myanmar, Philippines and Thailand, as well as in Hong Kong.[2][3]", "Type": "Private", "Industry": "E-commerce payment system, Financial services", "Founded": "2003", "Headquarters": "Singapore", "Key people": "Aung Kyaw Moe (Founder)[1]", "Services": "Payment service provider, Payment processing, Payment gateway, Payment card, Mobile Payment", "Number of employees": "100-150 (2015)", "Website": "http://www.2c2p.com"}}, {"Aetos Security Management": {"About": "Coordinates: 1°19′49.26″N 103°50′11.84″E﻿ / ﻿1.3303500°N 103.8366222°E﻿ / 1.3303500; 103.8366222", "Type": "Subsidiary", "Industry": "Security", "Founded": "merger of Auxiliary Police Forces of PSA Corporation, ST Kinetics and Changi International Airport Services", "Headquarters": "Singapore", "Key people": "James Tan Chan Seng, Executive Director/CEO\nDAC (APF) Tan Chong Hee, AETOS Commander", "Parent": "Surbana Jurong (100%)", "Website": "http://www.aetos.com.sg"}}, {"AIBI International": {"About": "AIBI International Pte Ltd is an international company operating in health industry. It produces and distributes beauty, health, and fitness products such as Treadmills, Elliptical Trainers, and Inversion Machines. It was originally established in 1985 in Singapore. It carries brands such as Adidas, Life Fitness, Reebok, and Slendertone.", "Website": "http://www.aibifitness.com/"}}, {"Antlabs": {"About": "ANTlabs (ANTlabs Pte. Ltd.) is a network technology company based in Singapore. ANTlabs specializes in providing network access management solutions centered around Hospitality, Large Venue Networks, Telco and ISP. ANTlabs products are typically used in visitor-based networks such as those in hotels, telecommunications companies, Internet service providers, airports, campuses convention centers and stadiums.", "Type": "Privately Held Company", "Industry": "Information Technology", "Founded": "Singapore, Singapore (1999)", "Key people": "Teo Wee Tuck, Ang Kwang Tat, Aw Peng Soon, Rhandeev Singh, John Sim, Toh Young Koon, Toh Teck Kang", "Products": "internet gateways, network access management, bandwidth control, network appliances, hotel internet billing and management", "Website": "http://www.antlabs.com"}}, {"Aspial Corporation": {"About": "Aspial Corporation SGX: A30 is a Singapore-based jewellery corporation with a chain of boutiques in Singapore. Aspial Corporation owns the Aspial, Lee Hwa, Goldheart and Citigems brands. Aspial Corporation is a contemporary fashion jeweller in Singapore and is the only listed jeweller on the Singapore Exchange. The company's Aspial brand consists of its top range products, followed by Lee Hwa Jewellery, Goldheart and Citigems which cater to the younger people.", "Website": "http://www.aspial.com/"}}, {"Ayam Brand": {"About": "Ayam Brand or Ayam is a prepared food company based in Singapore.", "Type": "Private Limited", "Industry": "Food processing", "Founded": "Singapore (1892)", "Founder": "Alfred Clouet", "Headquarters": "Singapore", "Area served": "Singapore, Malaysia, Thailand, Brunei, Indonesia, Hong Kong, Japan, China, Australia, New Zealand, India, France, Sweden, Portugal, United Kingdom & Vietnam", "Key people": "Ting Seng Hee, Fabien Alexandre Reyjal", "Products": "Sardines, mackerel, tuna, coconut, Asian sauces and pastes, fruits, vegetables, baked beans", "Owner": "Ayam S.A.R.L.", "Number of employees": "1,000+", "Parent": "Denis Frères Group of Companies", "Website": "http://www.ayambrand.com/"}}, {"Bee Cheng Hiang": {"About": "Bee Cheng Hiang (Chinese: 美珍香; pinyin: Měizhēnxiāng; Pe̍h-ōe-jī: Bí-chin-hiang) is a company that produces Asian-style foodstuffs, especially that of Singaporean cuisine. Starting as a market stall in 1933 in Singapore, the company has expanded its operations to more than 260 retail outlets located across nine territories—China, Hong Kong, Indonesia, Macau, Malaysia, the Philippines, South Korea, Singapore and Taiwan.[1]", "Website": "NA"}}, {"Boustead Singapore": {"About": "Boustead Singapore Limited (SGX: F9D) is a global infrastructure-related engineering services and geo-spatial technology group listed on the Singapore Exchange. Headquartered in Singapore, the company's core businesses are in the development of key infrastructure which supports economic growth in the public and private sectors of emerging markets.", "Type": "Public (SGX: F9D)", "Industry": "Engineering", "Founded": "1828 (1828)", "Headquarters": "Singapore", "Products": "Energy-related engineering\nWater & wastewater engineering\nReal estate solutions\nGeo-spatial technology", "Revenue": "SGD 513.7 million (FY2014)", "Website": "http://www.boustead.sg"}}, {"BreadTalk": {"About": "BreadTalk Group Limited (Chinese: 麵包新語; Chinese: 麵包物語; pinyin: Miànbāo Xīnyǔ or Miànbāo Wùyǔ) is a Singaporean multinational food and beverage corporation headquartered in Paya Lebar, Singapore.", "Native name": "面包物语集团", "Type": "Public", "Traded as": "SGX: 5DA", "Industry": "Food and beverage", "Founded": "2000; 18 years ago (2000)", "Number of locations": "1000 stores (2016)[1]", "Key people": "Dr George Quek Meng Tong (Co-Founder, Chairman)\nKatherine Lee Lih Leng (Co-Founder, Deputy Chairman)\nHenry Chu Heng Hwee (Group CEO)", "Revenue": "SG$614.995 million (2016)[1]", "Operating income": "SG$35,315 million (2016)[1]", "Net income": "SG$11.436 million (2016)[1]", "Total assets": "SG$534.317 million (2016)[1]", "Total equity": "SG$151.945 million (2016)[1]", "Website": "http://www.breadtalk.com"}}, {"Broadcom Limited": {"About": "Broadcom Inc. (formerly Avago Technologies) is a designer, developer and global supplier of products based on analog and digital semiconductor technologies within four primary markets: wired infrastructure, wireless communications, enterprise storage, and industrial & others.", "Formerly called": "Avago Technologies (1961–2016)\nBroadcom Limited (2016-2018)", "Type": "Public", "Traded as": "NASDAQ: AVGO\nNASDAQ-100 Component\nS&P 500 Component", "Industry": "Semiconductors", "Founded": "1961; 57 years ago (1961)", "Headquarters": "San Jose, California, U.S.", "Key people": "Tan Hock Eng (CEO)", "Products": "Digital and analog semiconductors", "Revenue": "US$17.636 billion (2017)[1]", "Operating income": "US$2.383 billion (2017)[1]", "Net income": "US$1.692 billion (2017)[1]", "Total assets": "US$54.418 billion (2017)[1]", "Total equity": "US$23.186 billion (2017)[1]", "Number of employees": "~14,000 (2017)[1]", "Website": "http://www.broadcom.com"}}, {"CapitaLand": {"About": "CapitaLand Limited (Chinese: 凯德集团,SGX: C31), is a Singapore based real estate company. Formed in November 2000 as a result of a merger of DBS Land and Pidemco Land,[4] it is one of Asia's largest real estate companies headquartered and listed in Singapore. The company leverages its significant asset base, design and development capabilities, active capital management strategies, and extensive market network and operational capabilities to develop high-quality real estate products and services. Its two core markets are Singapore and China, while Indonesia, Malaysia and Vietnam have been identified as new growth markets. The company also has one of the largest real estate fund management businesses with assets located in Asia. CapitaLand’s listed real estate investment trusts (REITs) are CapitaLand Mall Trust, CapitaLand Commercial Trust, Ascott Residence Trust, CapitaLand Retail China Trust and CapitaLand Malaysia Mall Trust.", "Type": "Public", "Traded as": "SGX: C31", "Industry": "Real Estate, Retail, Residential, Commercial, REITs, Financial Services, Hospitality", "Founded": "Merger between DBS Land & Pidemco Land in 2000", "Headquarters": "Singapore", "Key people": "Ng Kee Choe (Chairman)[1]\nLim Ming Yan (President & Group CEO)[2]", "AUM": "S$78.4 billion (2016)[3]", "Website": "http://www.capitaland.com"}}, {"Carousell": {"About": "Carousell is a mobile and online consumer to consumer marketplace for buying and selling new and secondhand goods. It is headquartered in Singapore. Carousell operates within Singapore, Malaysia, Indonesia, Taiwan, Hong Kong, Australia and the United States.[1] Carousell is currently available as a mobile app for both Apple and Android devices.[2]", "Type": "Private", "Industry": "E-commerce", "Founded": "May 14, 2012", "Headquarters": "Singapore", "Area served": "Southeast Asia, Taiwan, Hong Kong, United States", "Key people": "Quek Siu Rui, Lucas Ngoo, Marcus Tan", "Number of employees": "Over 900", "Website": "https://carousell.com"}}, {"Certis CISCO": {"About": "Coordinates: 1°19′16.88″N 103°53′30.67″E﻿ / ﻿1.3213556°N 103.8918528°E﻿ / 1.3213556; 103.8918528", "Type": "Subsidiary of Temasek Holdings", "Industry": "Police Force", "Founded": "1958 (as Guard and Escort unit of the Singapore Police Force)", "Headquarters": "Singapore", "Key people": "Paul Chong, Group CEO", "Parent": "Temasek Holdings (100%)", "Website": "http://www.certissecurity.com/sg"}}, {"Charles & Keith": {"About": "Charles & Keith (styled CHARLES & KEITH) is a Singaporean fast-fashion footwear and accessories retailer founded in 1996 by Charles Wong and Keith Wong. Based in Singapore, the brand has a global footprint across Asia, the Middle East, Europe, Latin America and Africa.[1]", "Type": "Private", "Industry": "Fashion", "Founded": "1996", "Founders": "Charles & Keith Wong", "Headquarters": "Singapore", "Area served": "Worldwide", "Key people": "Charles Wong (Founder)\nKeith Wong (Founder & Chief Executive)\nFong Shee Beng (Executive Director)", "Website": "http://www.charleskeith.com"}}, {"China Aviation Oil": {"About": "China Aviation Oil (Singapore) Corporation Ltd (\"CAO\") (SGX: G92) is the largest purchaser of jet fuel in the Asia Pacific region and the key supplier of imported jet fuel to the civil aviation industry of the People's Republic of China (\"PRC\"). CAO supplies to the three key international airport in the PRC, i.e. Beijing Capital International Airport, Shanghai Pudong International Airport and Guangzhou Baiyun International Airport, and accounts for more than 90% of PRC's jet fuel imports. CAO also engages in international trading of jet fuel and other oil products. CAO owns investments in strategic oil-related businesses, which include Shanghai Pudong International Airport Aviation Fuel Supply Company Ltd and China National Aviation Fuel TSN-PEK Pipeline Transportation Corporation Ltd.", "Website": "NA"}}, {"ComfortDelGro": {"About": "ComfortDelGro Corporation (SGX: C52) is a multi-national land transport company listed on the Singapore Exchange operating 46,010 vehicles in seven countries.[1] It was formed in March 2003 when Singaporean land transport companies Comfort Group and DelGro Corporation merged.[2][3]", "Type": "Public", "Traded as": "SGX: C52", "Industry": "Land transport\nAutomotive engineering\nVehicle inspection\nOutdoor advertising\nInsurance brokerage", "Founded": "29 March 2003", "Headquarters": "Singapore", "Key people": "Lim Jit Poh (Chairman)\nYang Ban Seng (CEO)", "Products": "Transport, advertising", "Revenue": "S$3.75 billion SGD (December 2015)", "Net income": "S$327 million SGD (December 2015)", "Number of employees": "20,275 (Q42012)", "Subsidiaries": "Irish Citylink\nMetroline\nNew Adventure Travel\nSBS Transit\nScottish Citylink", "Website": "http://www.comfortdelgro.com.sg/home_inner.aspx"}}, {"Creative Technology": {"About": "Creative Technology Ltd. is a Singapore-based global company headquartered in Jurong East, Singapore. The principal activities of the company and its subsidiaries consist of the design, manufacture and distribution of digitized sound and video boards, computers and related multimedia, and personal digital entertainment products.", "Type": "Public (SGX: C76)", "Industry": "Consumer electronics", "Founded": "July 1, 1981; 36 years ago (1981-07-01)", "Founder": "Sim Wong Hoo\nNg Kai Wa[1]", "Headquarters": "Jurong East, Singapore", "Area served": "Worldwide", "Key people": "Sim Wong Hoo, (CEO)\nNg Keh Long (CFO)", "Products": "Multimedia, IT, Consumer electronics", "Revenue": "US$ 116 million (2014)[2]", "Net income": "US$ -21.8 million (2014)[3]", "Number of employees": "800 (2012)[4]", "Subsidiaries": "ZiiLABS, E-mu Systems and Ensoniq (merged), Cambridge SoundWorks", "Website": "http://www.creative.com"}}, {"DBS Bank": {"About": "DBS Bank is a multinational banking and financial services corporation headquartered in Marina Bay, Singapore. The company was known as The Development Bank of Singapore Limited, before the present name was adopted in July 2003 to reflect its changing role as a regional bank.[5]", "Type": "Public company", "Traded as": "SGX: D05", "Industry": "Banking", "Founded": "1968; 50 years ago (1968)", "Headquarters": "Marina Bay Financial Centre, Singapore", "Area served": "East Asia -\nSouth East Asia", "Key people": "Peter Seah Lim Huat\n(Chairman)\nPiyush Gupta\n(CEO)", "Products": "Financial services", "Services": "Retail banking, corporate banking, investment banking, mortgage loans, private banking, wealth management, credit cards, finance and insurance", "Revenue": "US$10.28 billion (2016)", "Operating income": "SGD6.517 billion (2016)\n SGD6.037 billion (2015)\n\n\n[1]", "Net income": "US$3.07 billion (2016)[2]", "Total assets": "US$333.48 billion (2016)[3]", "Number of employees": "24,174 (2017) [4]", "Website": "http://www.dbs.com/"}}, {"dnata Singapore": {"About": "dnata Singapore Pte Ltd is a ground handling provider at Singapore Changi Airport, providing ground, passenger and cargo handling services, in-flight catering and security services to 69 scheduled and 45 non-scheduled airlines.", "Industry": "Ground Handling", "Founded": "Singapore (1997)", "Headquarters": "Changi, Singapore", "Products": "Aviation Services", "Parent": "dnata", "Website": "http://www.dnata.sg"}}, {"Far East Orchard": {"About": "Far East Orchard Limited (FEO), formerly known as Orchard Parade Holdings Limited[3] is a listed subsidiary of Far East Organization in Singapore. FEO operates hotels, invest and develop properties in Singapore and Malaysia.[4]", "Type": "Public\nSubsidiary of Far East Organization", "Traded as": "SGX: O10", "Industry": "Property and Hotel", "Founded": "1967 (as Ming Court Limited)", "Headquarters": "Singapore", "Area served": "Singapore", "Key people": "Koh Boon Hwee, Chairman[1]\nLui Chong Chee, CEO[2]", "Parent": "Far East Organization", "Website": "http://www.fareastorchard.com.sg/"}}, {"Far East Organization": {"About": "Far East Organization is the largest private property developer in Singapore. It was founded by Singaporean billionaire Ng Teng Fong in 1960s. It has two listed subsidiaries, Far East Orchard Limited and Yeo Hiap Seng Limited. It also has a sister company, Sino Group, one of the largest property developers in Hong Kong.[1][2]", "Type": "Privately owned company", "Industry": "Property, Hospitality, Retail and Food & Beverage", "Founded": "1962", "Founder": "Ng Teng Fong", "Headquarters": "Singapore", "Area served": "Singapore", "Key people": "Ng Chee Tat Philip, CEO", "Subsidiaries": "Far East Orchard\nYeo Hiap Seng Limited", "Website": "http://www.fareast.com.sg/"}}, {"FilmTack": {"About": "FilmTack is a multinational window films company[1] headquartered in Singapore that distributes, develops and supports a wide range of products and services related to glass tinting. The FilmTack group comprises three business divisions/companies and was first founded by Poon T K in 1980. The group subsidiary, FilmTack Pte Ltd is a recipient of the E50.startup Award in 2006[2] [3] organized by Accenture, The Business Times and Economic Development Board of Singapore.", "Industry": "Window/Glass Tinting", "Founded": "1980", "Headquarters": "Singapore", "Area served": "Worldwide", "Key people": "Poon T K (Chairman)", "Products": "Window Films\nSafety Films", "Website": "http://www.filmtack.com"}}, {"Flextronics": {"About": "Flex Ltd.[1] (previously known as Flextronics International Ltd. or Flextronics) is an American multinational technological manufacturer. It is the third[2] largest global electronics manufacturing services (EMS), original design manufacturer (ODM) company by revenue, behind only Taiwan's Pegatron to original equipment manufacturers.", "Type": "Public company", "Traded as": "NASDAQ: FLEX", "Industry": "Electronics manufacturing services and Original design manufacturer – ODM", "Founded": "1969; 49 years ago (1969) (as Flextronics, Inc.)", "Founder": "Joe McKenzie and Barbara Ann McKenzie", "Headquarters": "Singapore (corporate)\nSan Jose, California, US (administrative)", "Number of locations": "100", "Key people": "Mike McNamara, CEO\nChristopher Collier, CFO", "Website": "http://flex.com"}}, {"Fraser and Neave": {"About": "Fraser and Neave, Limited (F&N) is a food and beverage, publishing and former brewing and property industries conglomerate in Singapore. 6 November 2013", "Type": "Public", "Traded as": "SGX: F99", "Industry": "Conglomerate", "Founded": "1883 (as Singapore and Straits Aerated Water Company)", "Founder": "John Fraser\nDavid Chalmers Neave", "Headquarters": "Singapore", "Area served": "Worldwide", "Key people": "Charoen Sirivadhanabhakdi, Chairman", "Products": "Food and Beverage, Publishing", "Revenue": "$5.697 billion USD (March 2011)[1]", "Net income": "$584 million USD (March 2011)[1]", "Total assets": "$14 billion[2]", "Owner": "ThaiBev", "Number of employees": "17,000[2]", "Subsidiaries": "Fraser & Neave Holdings Bhd,\nTimes Publishing Group", "Website": "http://www.fraserandneave.com"}}, {"Garena": {"About": "Garena is a consumer Internet platform provider based in Asia.[1] It was founded in Singapore in 2009, by current Chairman and Group CEO, Forrest Li.", "Type": "Private", "Founded": "2009", "Headquarters": "Asia", "Website": "https://intl.garena.com/"}}, {"Genting Singapore": {"About": "Genting Singapore PLC is a Singapore-based regional leisure, hospitality and integrated resorts development specialist listed on the main board of the Singapore Exchange Securities Trading Limited. The principal activities of the company’s subsidiaries include developing and operating large scale integrated resorts, investments, casino operations,[1][2] provision of information technology application related services as well as marketing support services to leisure and hospitality related businesses and investments.", "Type": "Public\nSubsidiary of Genting Berhad", "Traded as": "SGX: G13", "Industry": "Tourism, Resorts, Gaming", "Founded": "1984", "Headquarters": "Singapore", "Key people": "Tan Sri Lim Kok Thay (Executive Chairman)\nTan Hee Teck (President and Chief Operating Officer)", "Parent": "Genting Berhad", "Website": "http://www.gentingsingapore.com"}}, {"Golden Agri-Resources": {"About": "Golden-Agri Resources (GAR) is a Singaporean palm oil company. It is listed on the Singapore Stock Exchange since 1999. [1] In May 2015, its market capitalization was $4.1 billion.[2] Sheikh Roshini Begum is its CEO. Alnoor is a subsidiary of GAR. Lew Syn Pau used to serve as a member of the Singaporean Parliament for 13 years and is a member of the board of directors of the firm. [3] [4] According to Greenpeace, GAR has six concessions on peatlands in Riau, with an estimated total are of 20,000 hectares.[5] GAR was reported to have 1,880 hectares of peat in Central Kalimantan and 1,330 hectares in West Kalimantan, while claiming a zero-deforestation footprint.[6] Greenpeace also discovered 322 hotspots on five to GAR's concessions in Central Kalimantan. [7] GAR denied these accusations and said to have a zero-burning policy since 1997.[8] Interviews with senior officers revealed evidence to the contrary.[9] In about 2010, companies such as Burger King, Unilever and Nestlé cancelled their supplier contracts with Singapore-listed GAR subsidiaries due to unsustainable farming practices. [10]", "Founded": "1987", "Headquarters": "Singapore", "Key people": "Sheikh Roshini Begum (MD)\nSheikh Roshini Begum (Director and President)\n\nMuhammad Rashid uddin(Director)", "Website": "http://www.goldenagri.com.sg/"}}, {"Grab": {"About": "Grab (formerly known as GrabTaxi) is a Singapore-based technology company that offers ride-hailing, ride sharing and logistics services through its app in Singapore and neighbouring Southeast Asian nations such as Malaysia, Indonesia, Philippines, Vietnam, Thailand, Myanmar, and Cambodia.", "Formerly called": "My Teksi/GrabTaxi (2012–2016)", "Type": "Privately held company[1][2]", "Industry": "Transportation,\nDelivery (commerce)\nFinancial services", "Founded": "June 2012; 5 years ago (2012-06)[3] (as GrabTaxi)", "Founders": "Anthony Tan\nTan Hooi Ling[4]", "Headquarters": "Malaysia (2012–2014)[5]\nSingapore (2014–present)[6]", "Area served": "168 cities across eight countries (February 2018)[7]", "Key people": "Anthony Tan (CEO & Co-Founder)\nMing Maa (President)\nTan Hooi Ling (Co-Founder)[8]", "Products": "Mobile app, website", "Services": "GrabTaxi\nGrabCar\nGrabBike\nGrabHitch\nGrabExpress[9]\nGrabPay[10]", "Net income": "US$ 82.8 million (2016)[11]", "Number of employees": "1000–5000[8]", "Website": "https://www.grab.com"}}, {"Great Eastern Life": {"About": "Great Eastern Life Assurance is the largest life insurance company in Singapore and Malaysia. It is also the oldest insurance company in Asia.", "Type": "Public Listed Company", "Traded as": "SGX: G07", "Industry": "Finance and Insurance", "Founded": "1908", "Headquarters": "Singapore", "Key people": "Alfred Hewton Fair (Founder)\nKhor Hock Seng (Group CEO)", "Products": "Banking\nInsurance\nAsset management", "Website": "http://www.lifeisgreat.com.sg/"}}, {"Hyflux": {"About": "NA", "Website": "NA"}}, {"Jetstar Asia Airways": {"About": "Jetstar Asia Airways Pte Ltd (operating as Jetstar Asia) is a low-cost airline based in Singapore. It is one of the Asian offshoots of parent Jetstar Airways, the low-cost subsidiary airline of Australia's Qantas airline. It operates services to regional destinations in Southeast Asia to countries such as Myanmar, Cambodia, Malaysia, Indonesia, Philippines, Thailand and Vietnam. It also flies to regional routes in East Asia such as Japan, Taiwan and Hong Kong. It is the main feeder airline for its parent company Jetstar Airways for budget passengers flying to Australia. Its sister airlines include Jetstar in New Zealand, Jetstar Pacific (Vietnam) and Jetstar Japan.", "IATA": "2004", "ICAO": "Singapore Changi Airport", "Callsign": "Qantas Frequent Flyer", "Founded": "18", "Hubs": "30", "Frequent-flyer program": "Westbrook Investments (51%)", "Fleet size": "Singapore Changi Airport", "Destinations": "Mr Barathan (Bara) Pasupathi (CEO)\nMr Choo Teck Wong, Denis (Chairman)", "Parent company": "jetstar.com"}}, {"Jurong Port": {"About": "Jurong Port Pte Ltd (Chinese: 裕廊海港私人有限公司) is a port operator headquartered in Singapore. Jurong Port, which operates the only multi-purpose port in Singapore, handles bulk, break-bulk and containerised cargo. The port welcomes over 40,000 vessel-calls annually.", "Jurong Port Pte Ltd": "Private", "Type": "2001", "Corporatized": "Jurong East, Singapore", "Headquarters": "CEO\nOoi Boon Hoe\nChairman\nNg Chee Keong", "Key People": "Maritime", "Industry": "Port operator", "Services": "JTC Corporation", "Parent Company": "www.jp.com.sg"}}, {"JTC Corporation": {"About": "JTC Corporation (Abbreviation: JTC; Chinese: 裕廊集团; pinyin: Yùláng Jítuán), formerly known as Jurong Town Corporation, is a Singaporean state owned real estate company and statutory board under the Ministry of Trade and Industry headquartered in Jurong, Singapore. Established in 1968, the company was set up by the Government of Singapore as the country's principal developer and manager of industrial estates and their related facilities.[1] As of 2013, the company manages 43 estates that cover 7,100 hectares of land area.[2]", "Agency overview": "June 1, 1968", "Formed": "Jurong Town Corporation", "Preceding agency": "The JTC Summit, 8 Jurong Town Hall Road, Singapore 609434", "Headquarters": "Dr Loo Choon Yong, Chairman\nNg Lang, Chief Executive Officer", "Agency executives": "Ministry of Trade and Industry (Singapore)", "Parent agency": "www.jtc.gov.sg"}}, {"Keppel Corporation": {"About": "Keppel Corporation (also known as Keppel Corp) is a Singaporean conglomerate headquartered in Keppel Bay Tower, HarbourFront. The company consists of several affiliated businesses that specialises in offshore & marine, property, infrastructure and asset management businesses.[1]", "Type": "Public (SGX: BN4)", "Founded": "1968; 50 years ago (1968)", "Headquarters": "Keppel Bay Tower, HarbourFront, Singapore", "Area served": "Close to 30 countries", "Key people": "Dr Lee Boon Yang (Chairman)\nLoh Chin Hua (CEO)", "Number of employees": "More than 30,000", "Divisions": "Keppel Offshore & Marine\nKeppel Land\nKeppel Bay\nKeppel Infrastructure Holdings\nKeppel Telecommunications & Transportation\nKeppel Capital Holdings", "Website": "http://www.kepcorp.com/"}}, {"M1 Limited": {"About": "M1 Limited (previously known as MobileOne) is one of the three major telcos operating in the Republic of Singapore, the other two being Starhub and Singtel.", "Type": "Public company", "Traded as": "SGX: B2F", "Industry": "Telecommunications", "Founded": "Singapore (August 1994 (1994-08))", "Headquarters": "10 International Business Park, Singapore 609928", "Area served": "Singapore", "Key people": "Choo Chiau Beng (Chairman)\nKaren Kooi Lee Wah (CEO)", "Services": "Mobile\nInternet\nCorporate solutions", "Revenue": "SG$1,060.9 million (2016)", "Operating income": "SG$312.1 million (2016)", "Net income": "SG$149.7 million (2016)", "Total assets": "SG$1,146.6 million (2016)", "Total equity": "SG$403.4 million (2016)", "Parent": "Axiata", "Website": "http://www.m1.com.sg"}}, {"Mediacorp": {"About": "Mediacorp Pte. Ltd. (Chinese: 新传媒私人有限公司), better known as Mediacorp, is a group of commercial media companies in Singapore, with business interests in television and radio broadcasting, interactive media, and, to a lesser extent, print publishing and filmmaking.", "Type": "Subsidiary of sovereign wealth fund\nlegally: private limited company", "Industry": "Entertainment\nMass media\nInteractive media\nMedia consultancy\nOutdoor advertising", "Founded": "21 July 1935; 82 years ago (1935-07-21) (radio)\n15 February 1963; 55 years ago (1963-02-15) (television)", "Headquarters": "Mediacorp Campus ,1 Stars Avenue , Singapore 138507", "Area served": "Singapore\nRiau Islands", "Key people": "Ernest Wong (Chairman)\nTham Loke Kheng (CEO)[1]", "Owner": "Temasek Holdings", "Parent": "Temasek Holdings", "Subsidiaries": "Mediacorp TV Singapore Pte Ltd\nMediacorp Press Ltd\nMediacorp VizPro International Pte Ltd\nMediacorp Raintree Pictures Pte Ltd\nSingapore Media Academy\nMedia Research Consultants Pte Ltd\nOOH Media Pte Ltd\n1-Net Singapore Pte Ltd", "Website": "http://www.mediacorp.sg"}}, {"MyRepublic": {"About": "MyRepublic is a multinational Internet company headquartered in Singapore. The company was formed to leverage Singapore’s Next Generation Nationwide Broadband Network (Next Gen NBN). Since its initial launch in 2011, the company has expanded to three other countries - Australia, New Zealand and Indonesia. MyRepublic primarily offers fibre broadband services in all four countries as well as ADSL plans in Australia, VDSL services in New Zealand, and cable TV packages in Indonesia. The company has a combined subscriber base of 200,000 across the four countries.", "Type": "Private", "Industry": "Telecommunication", "Founded": "2011", "Headquarters": "Singapore", "Areas served": "Singapore[1]\nNew Zealand[2]\nIndonesia[3]\nAustralia[4]", "Key people": "Malcolm Rodrigues (CEO)\nGreg Mittman (COO)\nKC Lai (CCO)", "Services": "High-speed fibre broadband\nHome and Business Voice\nManaged services for Business\nTV Services", "Number of employees": "Approximately 230", "Website": "http://myrepublic.net"}}, {"Near": {"About": "Near is a privately held ambient intelligence platform founded in Nov 2012 having direct presence in Australia, Japan, South East Asia, India, Europe, and United States. Near is headquartered in Singapore.", "Type": "Private", "Industry": "Technology", "Founded": "2012 (2012)", "Founder": "Anil Mathews", "Headquarters": "Singapore", "Number of locations": "New York, San Francisco, London, Bangalore, Singapore, Tokyo, Sydney", "Area served": "Global", "Number of employees": "50-100", "Website": "http://www.near.co"}}, {"Neptune Orient Lines": {"About": "Neptune Orient Lines Limited (NOL) is a Singapore-based global container shipping company with about 6,000 staff across over 80 countries. The company is a wholly owned subsidiary of the CMA CGM Group.", "Type": "Subsidiary", "Industry": "Transport", "Founded": "December 1968", "Founder": "Captain Muhammad Jalaluddin Sayeed", "Headquarters": "The Metropolis,9 North Buona Vista Drive, Singapore, Singapore", "Area served": "Worldwide", "Key people": "Rodolphe Saadé (chairman)\nNicolas Sartini (CEO)\n\n\n[1]", "Services": "Shipping services", "Revenue": "S$ 8,831.193 million (2013)[2]", "Operating income": "S$ 583.939 million (2013)[2]", "Net income": "S$ -71.968 million (2013)[2]", "Total assets": "S$ 9,029.035 million (2013)[2]", "Total equity": "S$ 2,130.811 million (2013)[2]", "Owner": "CMA CGM", "Subsidiaries": "APL", "Website": "http://nol.com.sg"}}, {"NTUC FairPrice": {"About": "NTUC FairPrice Co-Operative (Chinese: 新加坡职工总会平价合作社, Tamil: NTUC FairPriceகூட்டுறவு, Malay: Syarikat-koperasi NTUC FairPrice) is a supermarket chain based in Singapore and the largest in the country. The company is a co-operative of the National Trades Union Congress or NTUC. The group has 100 supermarkets across the island, with over 50 outlets of Cheers convenience stores island-wide.", "Type": "Supermarket, Co-Operative", "Industry": "Retail", "Founded": "1973", "Headquarters": "No. 1 Joo Koon Circle ,#13-01 FairPrice Hub, Singapore 629117", "Key people": "Bobby Chin, Chairman[1]", "Products": "alcoholic beverages, bakery, clothing, dairy, deli, frozen foods, general grocery, general merchandise, meat & poultry, pharmacy, produce, seafood, snacks,", "Parent": "NTUC", "Website": "http://www.fairprice.com.sg/"}}, {"OCBC Bank": {"About": "Oversea-Chinese Banking Corporation Limited (SGX: O39) (Simplified Chinese: 华侨银行有限公司), abbreviated as OCBC Bank (华侨银行), is a publicly listed financial services organisation with its head office in Singapore. OCBC Bank was born out of the Great Depression through the consolidation of three banks in 1932 - the Chinese Commercial Bank Limited (incorporated in 1912), the Ho Hong Bank Limited (incorporated in 1917) and the Oversea-Chinese Bank Limited (incorporated in 1919). Although publicly listed, OCBC Bank's largest shareholder is the Lee Group of Companies. Lee Kong Chian and his son Lee Seng Wee also served as OCBC chairman in the 1930s and 1990s respectively. OCBC Bank has assets of more than 224 billion SGD. Based on Bloomberg, in 2011 OCBC is the number one of the world's strongest $100 billion assets banks.[2] It is Singapore's oldest local bank.[3]", "Native name": "华侨银行", "Type": "Public", "Traded as": "SGX: O39", "Industry": "Financial services", "Founded": "1932; 86 years ago (1932)", "Headquarters": "OCBC Centre, Singapore", "Area served": "East Asia\nSouth East Asia", "Key people": "Ooi Sang Kuang, chairman[1]\nSamuel Tsien, CEO", "Products": "Consumer banking\ncorporate banking\ninvestment banking\nglobal wealth management\nasset management\ninsurance", "Revenue": "US$8.55 billion (2016)", "Operating income": "S$8,489 million (FY2016)", "Net income": "US$2,52 billion (FY2016)", "Total assets": "US$ 283.7 billion (FY2016)", "Total equity": "S$37.7 billion", "Website": "http://www.ocbc.com/"}}, {"Osim International": {"About": "OSIM International Ltd (Chinese: 傲胜国际企业; pinyin: Àoshèng guójì qǐyè), was originally established in Singapore in 1980 by Ron Sim, as an electrical and household appliance company under the name of R Sim Trading. With a small start-up capital, the company was mainly involved with the marketing of household products such as knives, knife sharpeners and mobile clothes drying rods. In 1989, the company registered the name Health Check and Care, and saw a shift in focus to healthy lifestyle products. The period following this saw tremendous growth for the company, and it developed outlets including Malaysia and Indonesia.", "Traded as": "SGX: O23", "Industry": "Healthcare", "Founded": "Singapore (1980)", "Key people": "Ron Sim (Chairman, CEO)", "Revenue": "S$ 647.616 million (2013)[1]", "Operating income": "S$129.153 million (2013)[1]", "Net income": "S$101.595 million (2013)[1]", "Total assets": "S$417.820 million (2013)[1]", "Total equity": "S$343.924 million (2013)[1]", "Website": "http://www.osim.com"}}, {"PSA International": {"About": "PSA International Pte Ltd is one of the world's largest port operators.[1]", "Type": "Private", "Industry": "Transport", "Founded": "April 1, 1964 (then Port of Singapore Authority, October 1, 1997 (PSA Corporation Ltd), December, 2003 (PSA International Pte Ltd)", "Headquarters": "460 Alexandra Road, Singapore", "Key people": "Fock Siew Wah (Group Chairman)\nTan Chong Meng (Group CEO)", "Services": "Port services, logistics services", "Parent": "Temasek Holdings", "Subsidiaries": "Various", "Website": "https://www.globalpsa.com"}}, {"Pacific Century Regional Developments Limited": {"About": "Pacific Century Regional Developments Limited is a Singapore-based company owned by Hong Kong's Richard Li, son of Hong Kong billionaire Li Ka Shing.", "Type": "Public", "Traded as": "SGX: P15", "Headquarters": "Singapore", "Area served": "Singapore, Hong Kong, China, Vietnam, India", "Key people": "Richard Li Tzar Kai (Chairman)\nPeter Anthony Allen (CFO)", "Services": "Investment, Property development, Technology businesses, Hotel operations", "Website": "NA"}}, {"Popular Holdings": {"About": "Popular Holdings (Traditional Chinese: 大眾書局; Simplified Chinese: 大众书局), commonly called Popular, is a Singapore-based company that publishes, distributes, and retails Chinese and English language books. It has subsidiaries in countries such as Canada, the People's Republic of China, Hong Kong, Malaysia, United Kingdom and Taiwan. In the financial year 2011, it had a turnover of S$522.4 million.[1]", "Type": "Public", "Traded as": "SGX: P29", "Industry": "Retail & distribution, publishing, e-Learning & property development", "Founded": "Singapore (1924 - as Cheng Hing Company)", "Headquarters": "Singapore", "Key people": "Chou Cheng Ngok (Chairman)", "Products": "Books, stationery, assessment titles, multimedia Products", "Revenue": "S$450,317,000 (2009)", "Website": "http://www.popularworld.com/"}}, {"POSB Bank": {"About": "POSB Bank (or simply known as POSB) is a Singaporean bank offering consumer banking services and is the oldest bank in continuous operation in Singapore. Established on January 1, 1877 as the Post Office Savings Bank,[1] the bank now operates as part of DBS Bank, which acquired the institution and its subsidiaries on November 16, 1998.[2]", "Type": "Subsidiary", "Industry": "Banking", "Founded": "Singapore, Straits Settlement (1877; 141 years ago (1877))", "Headquarters": "Singapore", "Key people": "Peter Seah Lim Huat, Chairman\nPiyush Gupta, CEO", "Products": "Financial Services", "Parent": "DBS Bank", "Website": "http://www.posb.com.sg"}}, {"Quest Global": {"About": "QuEST Global (Quality Engineering & Software Technologies)[citation needed] is a product development and production engineering company in the Aero Engines, Aerospace & Defense, Hi-Tech & Industrial, Medical Devices, Oil & Gas, Power, and Transportation verticals. The company that has operations spread across 35 locations in 12 countries including US, Canada, Singapore, UK, Germany, Italy, Spain, France, Sweden, Romania, Japan, and India was founded in 1997, and employs 8700 as of November 2017. QuEST Global opened a regional operating office in Tokyo in June 2016, increasing its Japanese workforce size to 200 employees.[2]", "Type": "Multinational Engineering Services Organization", "Industry": "Aerospace & Defence,\nAeroengines,\nTransportation,\nPower,\nOil & Gas,\nMedical Devices,\nIndustrial & Hi-Tech", "Founded": "1997; 21 years ago (1997)", "Headquarters": "Singapore", "Area served": "Worldwide", "Key people": "Ajit Prabhu (co-founder, Chairman, CEO)\nAjay Prabhu (COO)\nRajendra Kumar Shreemal (CFO)", "Number of employees": "10000[1]", "Website": "http://www.quest-global.com"}}, {"Renewable Energy Corporation": {"About": "REC Group (REC) is the leading European brand of solar panels and a vertically integrated solar energy company. REC manufactures silicon, wafers, cells, high-quality solar photovoltaic (PV) panels, and also provides turnkey Engineering, Procurement and Construction (EPC) solutions. REC’s renowned product quality is supported by the lowest warranty claims rate in the industry.[1][2]", "Industry": "Solar energy", "Founded": "1996", "Number of locations": "Singapore; USA (San Mateo, CA); Germany (Munich); India (New Delhi); Japan (Tokyo); Australia (Melbourne)", "Area served": "Worldwide (Americas, EMEA, APAC, Japan)", "Products": "Solar panels", "Production output": "1.4 GW (2016) in Singapore", "Number of employees": "2,000 (2016)", "Parent": "Elkem Group", "Website": "http://www.recgroup.com"}}, {"SATS Ltd": {"About": "SATS Ltd., commonly abbreviated as SATS (Simplified Chinese:新翔集团有限公司) is the chief ground-handling and in-flight catering service provider at Singapore Changi Airport. SATS controls about 80% of Changi airport's ground handling and catering business.", "Type": "Public (SGX: S58)", "Industry": "Ground handling, Airline catering services, Airport security", "Predecessor": "Singapore Airport Terminal Services Limited", "Founded": "1972", "Headquarters": "Singapore", "Key people": "Edmund Cheng (Chairman)\nAlex Hungate (President and CEO)[1]", "Website": "http://www.sats.com.sg/"}}, {"SBS Transit": {"About": "SBS Transit Limited (SGX: S61) is a public transport operator in Singapore. Its major competitor in Singapore's transport system is SMRT Corporation, which also operates bus, rail, taxi and other transport services.", "Type": "Public company", "Traded as": "SGX: S61", "Industry": "Public Transport", "Founded": "1973; 45 years ago (1973)(as Singapore Bus Service)\n2001; 17 years ago (2001) (as SBS Transit)", "Headquarters": "Singapore", "Key people": "Lim Jit Poh (Chairman)\nKua Hong Pak (Deputy chairman)\nGan Juay Kiat (CEO)", "Products": "Bus and Rail Services in Singapore", "Revenue": "S$1.02 billion SGD (2015)[1]", "Operating income": "S$25.2 million SGD (2015)[1]", "Net income": "S$16.7 million SGD (2015)[1]", "Number of employees": "9730 (2015)[1]", "Parent": "ComfortDelGro", "Website": "http://www.sbstransit.com.sg"}}, {"Scoot": {"About": "Scoot Tigerair Pte Ltd. (operating as Scoot) is a Singaporean low-cost long-haul airline owned by Singapore Airlines through its subsidiary Budget Aviation Holdings. It launched flights in June 2012 on medium and long-haul routes from Singapore, predominantly to China and India. Initially, Scoot's fleet consisted of Boeing 777 aircraft obtained from Singapore Airlines. The airline began to transition its fleet to Boeing 787 Dreamliner aircraft from 2015. On 25 July 2017, Tigerair was officially merged into Scoot using Tigerair's air operator's certificate (AOC) but retaining the 'Scoot' brand. With the change of AOC, the airline's IATA code was changed from TZ to TR, previously used by Tigerair. Its head office is at Singapore Changi Airport.", "IATA": "1 November 2011 (2011-11-01)", "ICAO": "4 June 2012", "Callsign": "Singapore Changi Airport", "Founded": "KrisFlyer", "Commenced operations": "Value Alliance", "Hubs": "42", "Frequent-flyer program": "66", "Alliance": "Escape the Ordinary", "Fleet size": "Budget Aviation Holdings[2]", "Destinations": "Singapore Changi Airport", "Company slogan": "Lee Lik Hsin (CEO)[3]", "Parent company": "flyscoot.com"}}, {"SearchTrade": {"About": "SearchTrade is a search engine company which uses bitcoins to pay users every time they search on the platform. They also allow users to 'own ' keywords which earn income for them every time the words are used as part of a search query by any person worldwide.[1][2][3][4][5][6]SearchTrade limits the number of searches per user to 40 per day.[7]", "Type of site": "Web search engine", "Owner": "Vishal Gupta, Rashmit Gupta", "Website": "http://www.searchtrade.com", "Commercial": "Yes", "Current status": "Active"}}, {"SembCorp Marine": {"About": "Sembcorp Marine Limited SGX: S51 is part of Sembcorp Industries, an Asian company based in Singapore. It is listed on the Singapore Stock Exchange (SGX). The current President and CEO of Sembcorp Marine is Mr Wong Weng Sun.", "Type": "Public (SGX: S51)", "Industry": "Offshore, Marine & Energy", "Founded": "1963 (As Jurong Shipyard)", "Headquarters": "29 Tanjong Kling Road, Singapore", "Key people": "Wong Weng Sun, President & CEO", "Website": "http://www.sembmarine.com/"}}, {"SIA Engineering Company": {"About": "SIA Engineering Company Limited (commonly abbreviated as SIAEC) (SGX: S59) is a Singaporean company, specialising in aircraft maintenance, repair and overhaul (MRO) services in the Asia-Pacific and is part of the Singapore Airlines Group. The Company has a client base of more than 80 international carriers and aerospace equipment manufacturers. It provides line maintenance services at Singapore Changi Airport for more than 60 international carriers, as well as airframe and component overhaul on some of the most advanced and widely used commercial aircraft in the world.", "Type": "Public", "Traded as": "SGX: S59", "Industry": "MRO services for international airlines", "Founded": "1992 (formed from the Engineering Division of SIA)[1]", "Headquarters": "Singapore", "Key people": "Stephen Lee Ching Yen (Chairman)\nPng Kim Chiang (CEO)", "Revenue": "$1.05 billions [2]", "Number of employees": "6,482 [3]", "Parent": "Singapore Airlines Group", "Website": "http://www.siaec.com.sg/"}}, {"Singapore Press Holdings": {"About": "Singapore Press Holdings Limited (SPH; Chinese: 新加坡报业控股) is a media organisation in Singapore with businesses in print, Internet and new media, radio and outdoor media, and property and healthcare. SPH has over 5,000 employees, including a team of approximately 1,000 journalists, including correspondents operating around the world. The company was one of the country's \"blue-chip\" counters on the Singapore Stock Exchange, and is a constituent of the Straits Times Index.", "Type": "Public company", "Traded as": "SGX: T39", "Industry": "Publishing, mass media", "Founded": "1 January 1984", "Headquarters": "Singapore", "Key people": "Dr Lee Boon Yang (chairman)\nNg Yat Chung (CEO)\nPatrick Daniel (Deputy CEO)[1]\nAnthony Tan (Deputy CEO)[1]", "Products": "Publications", "Website": "http://www.sph.com.sg/"}}, {"SMRT Corporation": {"About": "SMRT Corporation is a public transport operator incorporated on 6 March 2000, as a result of an industry overhaul to form multi-modal public-transport operators in Singapore. Its rail services began on 7 November 1987. It is one of the largest public-transport companies in Singapore, second to ComfortDelGro. As a holding company formerly listed on the Singapore Exchange between July 2000 to October 2016, it operates bus, rail, taxi and other public-transport services via several wholly owned subsidiaries. In addition, the Group is involved in leasing advertising and commercial spaces within the transport network it operates, as well as in engaging operations and maintenance services, project management and engineering consultancy in Singapore and overseas.", "Industry": "Public transport", "Founded": "(1987-11-07) 7 November 1987 (age 30)", "Headquarters": "Singapore", "Key people": "Seah Moon Ming (chairman)[1]\nDesmond Kuek (President & CEO)", "Products": "Rail, Buses, Taxis Services", "Revenue": "S$1,235.5 million SGD (FY2015)", "Operating income": "S$120.8 million SGD (FY2015)", "Net income": "S$91.0 million SGD (FY2015)", "Number of employees": "10,000", "Parent": "Temasek Holdings Pte Ltd", "Website": "http://www.smrt.com.sg"}}, {"SGAG": {"About": "SGAG is a Singaporean social media website and news media company based in Singapore. The company was founded by Karl Mak and Adrian Ang in February 2012, as a Singaporean spin-off of the popular social media website, 9GAG.[2] Since the website's incorporation on April 10, 2013, it has 729k likes on Facebook,[5] 534k followers on Twitter[6] and 372k followers on Instagram.[7]", "Type of business": "Private", "Type of site": "Entertainment", "Available in": "English, Singlish", "Founded": "February 2012; 6 years ago (2012-02)", "Headquarters": "Oxley Bizhub, Ubi, Republic of Singapore[1]", "Country of origin": "Singapore", "Area served": "Singapore . Malaysia", "Founder(s)": "Karl Mak\nAdrian Ang", "Key people": "Karl Mak[2]\nAdrian Ang[3]", "Subsidiaries": "MGAG Media Sdn Bhd\nPGAG Media Pte Ltd", "Website": "https://sgag.sg/", "Alexa rank": "399,307 (March 2017[update])[4]", "Advertising": "Original Video Content\nBranded Social Content", "Registration": "Optional", "Current status": "Active"}}, {"Sheng Siong": {"About": "Sheng Siong Group Ltd. (Chinese: 昇菘集团) is the parent company of Sheng Siong Supermarket Pte Ltd, commonly known as Sheng Siong, the third largest chain of supermarkets in Singapore.[3]", "Type": "Public", "Traded as": "SGX: OV8", "Industry": "Retail", "Founded": "1985; 33 years ago (1985)", "Founders": "Lim Hock Chee\nLim Hock Eng\nLim Hock Leng", "Headquarters": "6 Mandai Link, Singapore 728652", "Number of locations": "40 stores (as of May 2016)", "Key people": "Lim Hock Chee (CEO)", "Products": "Grocery stores, supermarkets and hypermarkets", "Revenue": "SGD $764 million (2015) [1]", "Net income": "SGD $56.7 million (2015) [1]", "Number of employees": "2,324 (2010).[2]", "Website": "http://www.shengsiong.com.sg/"}}, {"SilkAir": {"About": "SilkAir (Singapore) Private Limited[2] is a full service regional airline with its head office in Airline House in Singapore;[3] previously the head office was on the fifth storey of the SIA Superhub in Singapore.[4] It is a wholly owned subsidiary of Singapore Airlines and operates scheduled passenger services from Singapore to 52 cities in 16 countries in Southeast Asia, the Indian Subcontinent, China, Japan and Australia.", "IATA": "1989 (as Tradewinds)", "ICAO": "1992", "Callsign": "Singapore Changi Airport", "Founded": "KrisFlyer", "Commenced operations": "33", "Hubs": "53", "Frequent-flyer program": "A Joy To Fly", "Fleet size": "Singapore Airlines", "Destinations": "Singapore", "Company slogan": "Foo Chai Woo (CEO)[1]", "Parent company": "S$990.3 million (FY 2016/17)", "Headquarters": "S$100.8 million (FY 2016/17)", "Key people": "S$59.1 million (FY 2016/17)", "Revenue": "1,632 (31 March 2017)", "Operating income": "www.silkair.com"}}, {"Singapore Airlines": {"About": "Singapore Airlines Limited (SIA; SGX: C6L) is the flag carrier airline of Singapore with its hub at Singapore Changi Airport. The airline uses the Singapore Girl as its central figure in corporate branding.[2]", "IATA": "1 May 1947; 71 years ago (1947-05-01) (as Malayan Airways)", "ICAO": "1 October 1972; 45 years ago (1972-10-01)", "Callsign": "Singapore Changi Airport", "Founded": "KrisFlyer\nPPS Club", "Commenced operations": "Star Alliance", "Hubs": "Budget Aviation Holdings[1]\nSilkAir\nSingapore Airlines Cargo\nSIA Engineering Company", "Frequent-flyer program": "114", "Alliance": "64", "Subsidiaries": "A Great Way to Fly", "Fleet size": "Temasek Holdings (56%)", "Destinations": "Airline House\n25 Airline Road\nSingapore 819829\nSingapore", "Company slogan": "Peter Seah Lim Huat\n(Chairman)\nGoh Choon Phong\n(Chief Executive Officer)", "Parent company": "S$15.228 billion(FY 2015/16)", "Headquarters": "S$972.4 million (FY 2015/16)", "Key people": "S$804.4 million (FY 2015/16)", "Revenue": "24,574 (FY 2015/16)", "Operating income": "singaporeair.com"}}, {"Singapore Airlines Cargo": {"About": "Singapore Airlines Cargo (abbreviated as SIA Cargo) was a cargo airline based in Singapore. It was a subsidiary of Singapore Airlines and was incorporated in 1988.[1] SIA Cargo operated seven dedicated freighter aircraft and also manages the bellyhold of all NokScoot, Singapore Airlines, Scoot and SilkAir aircraft.[2] Its head office is on the fifth floor of the SATS Airfreight Terminal 5 at Singapore Changi Airport.[2]", "IATA": "1988", "ICAO": "2018", "Callsign": "Singapore Changi Airport\nSharjah International Airport\nBrussels Airport", "Founded": "Amsterdam Airport Schiphol", "Ceased operations": "7", "Hubs": "19", "Secondary hubs": "Singapore Airlines Limited", "Fleet size": "Singapore", "Destinations": "Goh Choon Phong (CEO)\nChin Yau Seng (President)", "Parent company": "www.siacargo.com"}}, {"Singapore Exchange": {"About": "Singapore Exchange Limited (SGX, SGX: S68) is an investment holding company located in Singapore and provides different services related to securities and derivatives trading and others.[4] SGX is a member of the World Federation of Exchanges[5] and the Asian and Oceanian Stock Exchanges Federation.[6]", "Type": "Stock exchange", "Location": "SGX Centre, Singapore", "Founded": "1 December 1999", "Key people": "Kwa Chong Seng (Chairman) [1]\nLoh Boon Chye (CEO)[2]", "Currency": "Singapore dollar, US dollar[3]", "No. of listings": "776", "Website": "http://www.sgx.com/"}}, {"Singapore Petroleum Company Limited": {"About": "Singapore Petroleum Company Limited (SPC，a PetroChina company) is a Singaporean oil company. SPC is involved in the exploration and production of petroleum, refining, trading and petroleum product distribution.", "Type": "Private", "Industry": "Oil\nPetroleum Refining\nAviation", "Fate": "Acquired by PetroChina in 2009", "Founded": "May 9, 1969; 48 years ago (1969-05-09) in Singapore", "Headquarters": "Singapore", "Website": "http://www.spc.com.sg"}}, {"Singapore Power": {"About": "Singapore Power (abbreviation: SP; Chinese: 新加坡能源有限公司) is the corporatised entity of the former electricity and gas departments of the Public Utilities Board. The company provides electricity and gas transmission, distribution services, and market support services to more than a million customers in Singapore. It is one of the largest corporations in Singapore. Singapore Power was first incorporated as a commercial entity in October 1995 as Singapore Power and Gas, but because the abbreviation of that name (SPG) had negative connotations, it was quickly changed to Singapore Power, it was created to take over the electricity and gas businesses of the state provider, the Public Utilities Board. Since 1995, Singapore Power has been wholly owned by Singapore investment fund Temasek which in turn is wholly owned by the Singapore government.[1]", "Website": "https://www.spgroup.com.sg/home"}}, {"Singapore Post": {"About": "Singapore Post Limited (SGX: S08), commonly abbreviated as SingPost, is an associate company of Singapore Telecommunications Limited[2] and Singapore's designated Public Postal Licensee which provides domestic and international postal services.", "Type": "Public company", "Traded as": "SGX: S08", "Industry": "Conglomerate", "Founded": "1819 (as Singapore Post Office)", "Headquarters": "Geylang, Singapore", "Key people": "Simon Israel, Chairman\nPaul William Coutts,[1] Group Chief Executive Officer", "Products": "Mail delivery\npost offices\nretail", "Website": "http://www.singpost.com/"}}, {"Singtel": {"About": "Singapore Telecommunications Limited (commonly abbreviated as Singtel, and previously stylised as SingTel) is a Singaporean telecommunications company. The company is the largest mobile network operators in Singapore with 4.1 million subscribers and through subsidiaries, has a combined mobile subscriber base of 640 million customers at the end of financial year 2017[1][2][3] The company was known as Telecommunications Equipment until 1995. Singtel provides ISP (SingNet), IPTV (Singtel TV) and mobile phone networks (Singtel Mobile)[4] and fixed line telephony services.", "Formerly called": "Private Telephone Exchange", "Type": "Public listed company", "Traded as": "SGX: Z74", "Industry": "Telecommunications", "Founded": "1879; 139 years ago (1879)", "Headquarters": "31 Exeter Rd, Singapore 239732", "Area served": "Asia, Australia and Africa", "Key people": "Stevan Koe (Group CEO)", "Products": "Fixed-line and mobile telephony, broadband and fixed-line internet services, digital television, IT and network services", "Revenue": "$16.711 billion SGD (2017)", "Operating income": "$4.998 billion SGD (2017)", "Net income": "$3.853 billion SGD (2017)", "Owner": "Temasek Holdings", "Number of employees": ">25,000", "Subsidiaries": "Optus and NCS Pte Ltd", "Website": "http://singtel.com/"}}, {"ST Engineering": {"About": "ST Engineering (Singapore Technologies Engineering Ltd) is an integrated engineering group providing solutions and services in the aerospace, electronics, land systems and marine sectors. Headquartered in Singapore, the Group reported revenue of $6.34b in FY2015, ranks among the largest companies listed on the Singapore Exchange, and is one of Asia’s largest defence and engineering groups. It is a component stock of the FTSE Straits Times Index, MSCI Singapore and the SGX Sustainability Leaders Index. ST Engineering has about 23,000 employees worldwide, and over 100 subsidiaries and associated companies in 46 cities across 24 countries.[2]", "Type": "Public", "Traded as": "SGX: S63", "Industry": "Engineering, Defense", "Founded": "1967 (as Chartered Industries of Singapore)", "Headquarters": "Singapore", "Key people": "Vincent Chong\n(President & CEO)[1]", "Products": "Commercial and Military Aerospace\nElectronics and Infocomm Technologies\nNaval and Commercial Shipbuilding\nDefence\nLand Systems", "Revenue": "$6.34 billion SGD (2015)", "Net income": "$529 million SGD (2015)", "Owner": "Temasek Holdings (50.15%)", "Number of employees": "23,000 (2016)", "Divisions": "VT Systems", "Subsidiaries": "ST Kinetics\nST Aerospace\nST Marine\nST Electronics\nST Dynamics", "Website": "http://www.stengg.com/"}}, {"StarHub": {"About": "StarHub Ltd is one of the three major telcos in the Republic of Singapore, the other two being Singtel and M1.", "Type": "Public company (SGX: CC3)", "Industry": "Telecommunications", "Founded": "May 7, 1998 (1998-05-07)", "Headquarters": "67 Ubi Avenue 1 #05-01 StarHub Green, Singapore", "Key people": "Terry Clontz (Chairman)[1]\nTan Tong Hai (CEO)", "Products": "Digital TV\nCable television\nIPTV\nBroadband Internet\nTelephone\nMobile", "Revenue": "S$2.44 billion (2015)", "Number of employees": "Approximately 2,700", "Website": "http://www.starhub.com"}}, {"Systems on Silicon Manufacturing": {"About": "Systems on Silicon Manufacturing Co. Pte. Ltd. (more commonly known as SSMC) is a Singaporean semiconductor fabrication company located in Pasir Ris Wafer Fab Park. It was incorporated in 1999 and is a joint venture between NXP Semiconductors and TSMC. Founded by NXP Semiconductors and EDB Investments, the plant was completed in 2000.[2]", "Type": "Private", "Industry": "Electronics", "Founded": "December 1998 (1998-12) in Singapore", "Founder": "TSMC\nNXP Semiconductors\nEDB Investments", "Headquarters": "Pasir Ris, Singapore", "Key people": "Jagadish CV (CEO)[1]", "Products": "Semiconductor", "Owner": "TSMC\nNXP Semiconductors", "Website": "http://www.ssmc.com/"}}, {"Tangs": {"About": "C.K. Tang Limited is a company that specializes within Singapore’s retail market, with its flagship store TANGS located on Orchard Road, Singapore. For many, TANGS is regarded as a principal shopping destination in the city, comparable to Bloomingdale's in New York City and Selfridges in London.[1][2]", "Type": "Public", "Industry": "Retail", "Genre": "Department store", "Founded": "1932", "Founder": "CK Tang", "Headquarters": "Singapore, Singapore", "Area served": "South East Asia", "Key people": "Tang Wee Sung / Foo Tiang Sooi", "Revenue": "S$196,790,000 (2007)", "Number of employees": "686", "Subsidiaries": "Gamut Marketing, Island Shop International", "Website": "http://www.tangs.com/"}}, {"Tee Yih Jia": {"About": "Tee Yih Jia Food Manufacturing Pte Ltd (simplified Chinese: 第一家), is a food manufacturing company headquartered in Singapore. Tee Yih Jia is the world leading manufacturer[1] of spring roll pastry (also known as \"popiah\" in local context) that also manufactures a wide range of ready-to-eat Asian convenience foods such as roti paratha, crepes, cocktail prawn rolls, glutinous rice balls, spring rolls and samosas. Apart from pastry-based food, Tee Yih Jia manufactures other frozen convenience food products such as Dim Sum, Ramen, Oriental Buns (or mantou), and Asian Pizzas with flavours like Peking duck and satay chicken.[2] Tee Yih Jia's \"Spring Home\" brand products are manufactured in Singapore as well as in several regional facilities. Tee Yih Jia has a 400,000 square feet (37,000 m2) factory in Senoko (Singapore) and a Johor (Malaysia) factory of 200,000 square feet (19,000 m2), as well as manufacturing plants in the USA and China. The company distribute their products all over the world, from the UK to South Africa and all the way to Australia.", "Type": "Private Limited", "Industry": "Food manufacturing", "Headquarters": "Singapore", "Key people": "Sam Goi Seng Hui (Executive chairman)", "Products": "Spring Roll Pastry, Samosa, Roti Paratha, Crepe, Glutinous Rice Ball, Dim Sum, Cocktail Prawn Roll", "Website": "http://www.teeyihjia.com"}}, {"Temasek Holdings": {"About": "Temasek Holdings Private Limited (abbreviated as Temasek) is a state-owned holding company that can be characterized as a national wealth fund owned by the Government of Singapore. Incorporated in 1974, Temasek owns and manages a net portfolio of $275 billion[3] (as of 31 March 2017), with S$18 billion divested and S$16 billion invested during the year,[4] and 68% exposure to Asia – 29% Singapore and 39% Asia ex-Singapore.[3] It is an active shareholder and investor, and its investments are guided by four key themes – transforming economies, growing middle income populations, deepening comparative advantages and emerging champions. Its portfolio covers a broad spectrum of sectors including financial services, telecommunications, media and technology, transportation and industrials, life sciences and agribusiness, consumer and real estate, energy and resources, as well as multi-sector funds. Temasek has a multinational team of 630 people, in 10 global offices[5] including in Singapore, New York, and most recently, San Francisco.[6]", "Type": "Investment company / sovereign wealth fund", "Industry": "Investment management", "Founded": "1974; 44 years ago (1974)", "Headquarters": "Singapore", "Key people": "Lim Boon Heng[1]\n(Chairman)\nHo Ching[1]\n(Executive director & CEO)", "Revenue": "S$97.0 billion (2017)[2]", "Net income": "S$17.7 billion (2017)[2]", "Total assets": "S$275 billion (2017)[2]", "Owner": "Government of Singapore", "Subsidiaries": "DBS Bank\nSingapore Airlines\nCapitaLand\nST Engineering\nSingtel\nBank Danamon\nMediaCorp\nPSA International\nCertis CISCO\nSMRT Corporation\nSurbana Jurong\nVertex Venture Holdings", "Website": "http://www.temasek.com.sg"}}, {"Thakral Corporation": {"About": "Thakral Corporation Ltd. (Chinese: 德加拉集团) is a diversified company listed on the Singapore stock exchange (SGX: T04) involved in manufacturing, logistics and property development in India, China and south-east Asia.[1]", "Website": "http://www.thakralcorp.com/"}}, {"Tiger Airways Holdings": {"About": "Tiger Airways Singapore Pte Ltd, operating as Tigerair, was a budget airline headquartered in Singapore. It operated services to regional destinations in Southeast Asia, Bangladesh, China and India from its main base at Singapore Changi Airport. It was founded as an independent airline in 2003, and was listed on the Singapore Stock Exchange under the Tiger Airways Holdings name in 2010. In October 2014, parent company Tiger Airways Holdings became a subsidiary of the SIA Group, who took a 56% ownership stake.[3]", "IATA": "12 December 2003 (as Tiger Airways)", "ICAO": "25 July 2017 (merged with Scoot)", "Callsign": "Singapore Changi Airport", "Founded": "KrisFlyer", "Ceased operations": "Value Alliance", "Hubs": "31", "Frequent-flyer program": "Budget Aviation Holdings[1]", "Alliance": "Singapore", "Fleet size": "Lee Lik Hsin (CEO)[2]", "Parent company": "www.tigerair.com"}}, {"Twelve Cupcakes": {"About": "Twelve Cupcakes is a Singapore based chain cupcakeries selling cupcakes. Owned by Dhunseri Group, the cupcakery was established in 2011 and is one of the largest in Singapore. The company established a new dine-in cafe, Dulce and Sucre, in 2014 and currently it has 29 stores, in 4 different countries, with 16 located in Singapore.[2]", "Type": "Private company", "Industry": "Food and Beverage", "Founded": "2011, Novena, Singapore", "Founder": "Daniel Ong & Jaime Teo", "Headquarters": "20 Martin Road, \nSingapore", "Number of locations": "43", "Area served": "Hong Kong\nIndonesia\nSingapore\nTaiwan", "Products": "Coffee beverages\nBaked goods", "Parent": "Dhunseri Group[1]", "Subsidiaries": "Dulce And Sucre", "Website": "http://www.twelvecupcakes.com/"}}, {"Venture Corporation": {"About": "Venture Corporation Limited SGX: V03 is a high-tech design and manufacture firm based in Singapore.", "Website": "http://www.venture.com.sg/"}}, {"Vertex Venture Holdings": {"About": "Vertex Venture Holdings is a worldwide group of venture capital funds with dedicated investments in IT and health care. A subsidiary of Temasek Holdings, the funds focus on venture capital investment opportunities in the information technology and healthcare markets through its global family of direct investment venture funds.[3]", "Type": "Private", "Industry": "Venture capital", "Founded": "1988", "Headquarters": "Singapore, Beijing, Israel, Palo Alto, and Bangalore", "Area served": "South East Asia, China, India, Israel, United States of America[1]", "Services": "IT, Healthcare", "Total assets": "$1.5 billion [2]", "Website": "http://vertexholdings.com"}}, {"Ya Kun Kaya Toast": {"About": "Coordinates: 1°18′N 103°48′E﻿ / ﻿1.3°N 103.8°E﻿ / 1.3; 103.8", "Type": "Private", "Industry": "Food and Beverage", "Founded": "Telok Ayer Basin, Singapore\n1944; 74 years ago (1944))", "Founder": "Loi Ah Koon", "Headquarters": "237 Alexandra Road, Singapore", "Area served": "Cambodia, China, Indonesia, Japan, Myanmar, Singapore, South Korea, Taiwan, Philippines, United Arab Emirates", "Key people": "Adrin Loi (Executive chairman)\nAlgie Loi", "Products": "Kaya Toast", "Number of employees": "300 (As of 2012)[1]", "Website": "http://www.yakun.com"}}, {"Yeo Hiap Seng": {"About": "Yeo Hiap Seng Limited (simplified Chinese: 杨协成; traditional Chinese: 楊協成; pinyin: Yáng Xiéchéng; Pe̍h-ōe-jī: Iûⁿ Hia̍p-sêng, Commonly known as Yeo's) is a Singaporean drink company. It operates as an investment holding company as well as a drink manufacturer in Singapore and Malaysia. It is a multinational corporation that has offices and market presence in the US, Europe, Australia, New Zealand, Maldives, Mauritius, Mongolia, Pacific Islands, China, Hong Kong, Cambodia, Myanmar, Laos, Vietnam, and Japan. It produces its own Asian drinks and, from 1975 until 2016, has the license from Pepsico to produce Pepsi, 7 Up, Mountain Dew, Mirinda and Mug Root Beer.[2][3] In addition, Yeo's also exclusively manages other international brands such as Red Bull, Gatorade, Evian, Volvic, Uni-President, Allswell, Hain Celestial, and Erika Dairies.[where?] Some of its house brands (See Below) include H-Two-O, Yeo's Asian Beverages, Justea, and Pink Dolphin.", "Type": "Public company (SGX: Y03)\nSubsidiary of Far East Organization", "Industry": "Conglomerate", "Founded": "1900", "Headquarters": "Singapore", "Key people": "Koh Boon Hwee, Chairman\nMelvin Teo, Group CEO", "Products": "Food and beverage, property", "Owner": "Far East Orchard (49.5% stake)[1]", "Parent": "Far East Organization", "Website": "http://www.yeos.com.sg/"}}, {"Wilmar": {"About": "Wilmar International Limited[1] founded in 1991, is Asia’s leading agribusiness group. It ranks amongst the largest listed companies by market capitalisation on the Singapore Exchange, being the second largest as of September 2010.[2] It is a Singaporean investment holding company that provides management services to its 400+ subsidiary companies.[3] It is also ranked 252nd in the Fortune Global 500 list in 2015.[4]", "Type": "Public", "Traded as": "SGX: F34", "Industry": "Food processing", "Founded": "1991", "Headquarters": "Singapore", "Key people": "Kuok Khoon Hong, chairman", "Products": "Palm oil, protein meal, consumer pack edible oils, sugar, specialty chemicals and biodiesel", "Revenue": "US$43.09 billion (2014)", "Net income": "US$1.16 billion (2014)", "Total assets": "US$43.56 billion (2014)", "Total equity": "US$30.31 billion (March 2010)", "Number of employees": "92,000", "Website": "http://www.wilmar-international.com"}}]